In [10]:
import pandas as pd

In [11]:
df = pd.read_csv("titanic.csv")
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [12]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [13]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [14]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [15]:
df1=inputs
df1

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [16]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [17]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [18]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [19]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [20]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [21]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0
6       1  54.000000  51.8625       0
7       3   2.000000  21.0750       0
8       3  27.000000  11.1333       1
9       2  14.000000  30.0708       1

In [22]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [23]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [24]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [25]:
model.score(X_test,y_test)

0.7835820895522388

In [26]:
X_test[0:10]

     Pclass        Age      Fare  female
651       2  18.000000   23.0000       1
519       3  32.000000    7.8958       0
198       3  29.699118    7.7500       1
802       1  11.000000  120.0000       0
140       3  29.699118   15.2458       1
141       3  22.000000    7.7500       1
185       1  29.699118   50.0000       0
470       3  29.699118    7.2500       0
587       1  60.000000   79.2000       0
608       2  22.000000   41.5792       1

In [27]:
y_test[0:10]

651    1
519    0
198    1
802    1
140    0
141    1
185    0
470    0
587    1
608    1
Name: Survived, dtype: int64

In [28]:
model.predict(X_test[0:10])

array([1, 0, 1, 1, 1, 1, 0, 0, 1, 1])

In [29]:
model.predict_proba(X_test[:10])

array([[0.20496303, 0.79503697],
       [0.97026207, 0.02973793],
       [0.42552472, 0.57447528],
       [0.01176986, 0.98823014],
       [0.42996699, 0.57003301],
       [0.3967678 , 0.6032322 ],
       [0.68018171, 0.31981829],
       [0.969662  , 0.030338  ],
       [0.24450878, 0.75549122],
       [0.17106545, 0.82893455]])

In [30]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.784     , 0.752     , 0.816     , 0.79032258, 0.72580645])